import random

countries = [['Абхазия', 'Сухум', 8600, 243564, 'Азия', 'Abwaij6'],
             ['Австрия', 'Вена', 83858, 8741753, 'Европа', 'Acstrj6'],
             ['Азербайджан', 'Баку', 86600, 9705600, 'Азия', 'Aifrbakehao'],
             ['Албания', 'Тирана', 28748, 2866026, 'Европа', 'Ambaoj6'],
             ['Алжир', 'Алжир', 2381740, 39813722, 'Африка', 'Amhjr'],
             ['Армения', 'Ереван', 29741, 2995100, 'Азия', 'Arnfoj6'],
             ['Афганистан', 'Кабул', 647500, 29822848, 'Азия', 'Avdaojstao'],
             ['Бангладеш', 'Дакка', 144000, 160221000, 'Азия', 'Baodmaefz'],
             ['Барбадос', 'Бриджтаун', 430, 291495, 'Северная Америка', 'Barbaeps'],
             ['Бахрейн', 'Манама', 701, 1397000, 'Азия', 'Bawrfko'],
             ['Белиз', 'Бельмопан', 22966, 377968, 'Северная Америка', 'Bfmji'],
             ['Беларусь', 'Минск', 207595, 9498400, 'Европа', 'Bfmarus3'],
             ['Бельгия', 'Брюссель', 32545, 11250585, 'Европа', 'Bfm3dj6'],
             ['Болгария', 'София', 110910, 7153784, 'Европа', 'Bpmdarj6'],
             ['Боливия', 'Сукре', 1098580, 10985059, 'Южная Америка', 'Bpmjcj6'],
             ['Ботсвана', 'Габороне', 600370, 2209208, 'Африка', 'Bptscaoa'],
             ['Бразилия', 'Бразилиа', 8511965, 206081432, 'Южная Америка', 'Braijmj6'],
             ['Бурунди', 'Гитега', 27830, 11099298, 'Африка', 'Buruoej'],
             ['Бутан', 'Тхимпху', 47000, 784000, 'Азия', 'Butao'],
             ['Великобритания', 'Лондон', 244820, 65341183, 'Европа', 'Cfmjlpbrjtaoj6'],
             ['Венгрия', 'Будапешт', 93030, 9830485, 'Европа', 'Cfodrj6'],
             ['Венесуэла', 'Каракас', 912050, 31028637, 'Южная Америка', 'Cfofsu4ma'],
             ['Вьетнам', 'Ханой', 329560, 91713300, 'Азия', 'C3ftoan'],
             ['Габон', 'Либревиль', 267667, 1811079, 'Африка', 'Dabpo'],
             ['Гайана', 'Джорджтаун', 214970, 741962, 'Южная Америка', 'Dakaoa'],
             ['Гамбия', 'Банжул', 11300, 2025527, 'Африка', 'Danbj6'],
             ['Гана', 'Аккра', 238540, 28308301, 'Африка', 'Daoa'],
             ['Гватемала', 'Гватемала', 108890, 16555556, 'Северная Америка', 'Dcatfnama'],
             ['Гвинея', 'Конакри', 245857, 10628972, 'Африка', 'Dcjof6'],
             ['Германия', 'Берлин', 357021, 82175684, 'Европа', 'Dfrnaoj6'],
             ['Гондурас', 'Тегусигальпа', 112090, 8721014, 'Северная Америка', 'Dpoeuras'],
             ['Греция', 'Афины', 131940, 10793526, 'Европа', 'Drfxj6'],
             ['Грузия', 'Тбилиси', 69700, 3720400, 'Азия', 'Druij6'],
             ['Дания', 'Копенгаген', 43094, 5707251, 'Европа', 'Eaoj6'],
             ['Джибути', 'Джибути', 22000, 890179, 'Африка', 'Ehjbutj'],
             ['Доминика', 'Розо', 754, 69393, 'Северная Америка', 'Epnjojla'],
             ['Египет', 'Каир', 1001450, 91701723, 'Африка', 'Fdjqft'],
             ['Замбия', 'Лусака', 752614, 16717000, 'Африка', 'Ianbj6'],
             ['Зимбабве', 'Хараре', 390580, 15967000, 'Африка', 'Ijnbabcf'],
             ['Израиль', 'Иерусалим', 22072, 8585000, 'Азия', 'Jirajm3'],
             ['Индонезия', 'Джакарта', 1904556, 255461700, 'Азия', 'Joepofij6'],
             ['Иордания', 'Амман', 89400, 9813095, 'Азия', 'Jpreaoj6'],
             ['Ирак', 'Багдад', 437072, 37883543, 'Азия', 'Jral'],
             ['Иран', 'Тегеран', 1648000, 80840713, 'Азия', 'Jrao'],
             ['Ирландия', 'Дублин', 70273, 4658530, 'Европа', 'Jrmaoej6'],
             ['Исландия', 'Рейкьявик', 103000, 332529, 'Европа', 'Jsmaoej6'],
             ['Испания', 'Мадрид', 497304, 46438422, 'Европа', 'Jsqaoj6'],
             ['Италия', 'Рим', 301340, 60665551, 'Европа', 'Jtamj6'],
             ['Йемен', 'Сана', 527970, 27478000, 'Азия', 'Kfnfo'],
             ['Камбоджа', 'Пномпень', 181040, 15827000, 'Азия', 'Lanbpeha'],
             ['Камерун', 'Яунде', 475440, 23924000, 'Африка', 'Lanfruo'],
             ['Канада', 'Оттава', 9976139, 36286425, 'Северная Америка', 'Laoaea'],
             ['Катар', 'Доха', 11437, 2553393, 'Азия', 'Latar'],
             ['Кения', 'Найроби', 582650, 44156577, 'Африка', 'Lfoj6'],
             ['Кипр', 'Никосия', 9250, 848319, 'Азия', 'Ljqr'],
             ['Киргизия', 'Бишкек', 198500, 6019500, 'Азия', 'Ljrdjij6'],
             ['Китай', 'Пекин', 9640821, 1410549741, 'Азия', 'Ljtak'],
             ['Колумбия', 'Богота', 1138910, 48892070, 'Южная Америка', 'Lpmunbj6'],
             ['Куба', 'Гавана', 110860, 11236348, 'Северная Америка', 'Luba'],
             ['Лаос', 'Вьентьян', 236800, 6492400, 'Азия', 'Maps'],
             ['Латвия', 'Рига', 64589, 1968957, 'Европа', 'Matcj6'],
             ['Лесото', 'Масеру', 30355, 2160000, 'Африка', 'Mfsptp'],
             ['Либерия', 'Монровия', 111370, 4001855, 'Африка', 'Mjbfrj6'],
             ['Ливан', 'Бейрут', 10452, 5988000, 'Азия', 'Mjcao'],
             ['Ливия', 'Триполи', 1759540, 6244174, 'Африка', 'Mjcj6'],
             ['Литва', 'Вильнюс', 65200, 2888558, 'Европа', 'Mjtca'],
             ['Лихтенштейн', 'Вадуц', 160, 37662, 'Европа', 'Mjwtfoztfko'],
             ['Мавритания', 'Нуакшот', 1030700, 3537368, 'Африка', 'Nacrjtaoj6'],
             ['Мадагаскар', 'Антананариву', 587040, 24430325, 'Африка', 'Naeadaslar'],
             ['Малави', 'Лилонгве', 118480, 17377468, 'Африка', 'Namacj'],
             ['Мали', 'Бамако', 1240000, 18135000, 'Африка', 'Namj'],
             ['Мальта', 'Валлетта', 316, 434403, 'Европа', 'Nam3ta'],
             ['Марокко', 'Рабат', 446550, 34817000, 'Африка', 'Narpllp'],
             ['Мексика', 'Мехико', 1972550, 122273473, 'Северная Америка', 'Nflsjla'],
             ['Мозамбик', 'Мапуту', 801590, 26423623, 'Африка', 'Npianbjl'],
             ['Молдова', 'Кишинёв', 33846, 3553056, 'Европа', 'Npmepca'],
             ['Мьянма', 'Нейпьидо', 678500, 51419420, 'Азия', 'N36ona'],
             ['Намибия', 'Виндхук', 825418, 2436469, 'Африка', 'Oanjbj6'],
             ['Непал', 'Катманду', 140800, 28431494, 'Азия', 'Ofqam'],
             ['Нигер', 'Ниамей', 1267000, 20715000, 'Африка', 'Ojdfr'],
             ['Нигерия', 'Абуджа', 923768, 186988000, 'Африка', 'Ojdfrj6'],
             ['Нидерланды', 'Амстердам', 41526, 16979120, 'Европа', 'Ojefrmaoe2'],
             ['Никарагуа', 'Манагуа', 129494, 6262703, 'Северная Америка', 'Ojlaradua'],
             ['Норвегия', 'Осло', 385186, 5213985, 'Европа', 'Oprcfdj6'],
             ['Оман', 'Маскат', 309500, 4523401, 'Азия', 'Pnao'],
             ['Пакистан', 'Исламабад', 881913, 196174380, 'Азия', 'Qaljstao'],
             ['Панама', 'Панама', 78200, 4037043, 'Северная Америка', 'Qaoana'],
             ['Парагвай', 'Асунсьон', 406750, 6854536, 'Южная Америка', 'Qaradcak'],
             ['Перу', 'Лима', 1285220, 31488625, 'Южная Америка', 'Qfru'],
             ['Польша', 'Варшава', 312685, 37967209, 'Европа', 'Qpm3za'],
             ['Португалия', 'Лиссабон', 92082, 10341330, 'Европа', 'Qprtudamj6'],
             ['Россия', 'Москва', 17102345, 146544700, 'Европа', 'Rpssj6'],
             ['Руанда', 'Кигали', 26338, 11533446, 'Африка', 'Ruaoea'],
             ['Румыния', 'Бухарест', 237500, 19759968, 'Европа', 'Run2oj6'],
             ['Сенегал', 'Дакар', 196190, 14799859, 'Африка', 'Sfofdam'],
             ['Сербия', 'Белград', 88361, 9846582, 'Европа', 'Sfrbj6'],
             ['Сингапур', 'Сингапур', 714, 5607300, 'Азия', 'Sjodaqur'],
             ['Сирия', 'Дамаск', 185180, 17185170, 'Азия', 'Sjrj6'],
             ['Словакия', 'Братислава', 48845, 5426252, 'Европа', 'Smpcalj6'],
             ['Словения', 'Любляна', 20253, 2064188, 'Европа', 'Smpcfoj6'],
             ['Сомали', 'Могадишо', 637657, 12316895, 'Африка', 'Spnamj'],
             ['Судан', 'Хартум', 1886068, 41176000, 'Африка', 'Sueao'],
             ['Суринам', 'Парамарибо', 163270, 558773, 'Южная Америка', 'Surjoan'],
             ['США', 'Вашингтон', 9522057, 322762018, 'Северная Америка', 'SZA'],
             ['Таджикистан', 'Душанбе', 143100, 8551000, 'Азия', 'Taehjljstao'],
             ['Таиланд', 'Бангкок', 514000, 68147000, 'Азия', 'Tajmaoe'],
             ['Танзания', 'Додома', 948087, 50142938, 'Африка', 'Taoiaoj6'],
             ['Того', 'Ломе', 56785, 7143000, 'Африка', 'Tpdp'],
             ['Тунис', 'Тунис', 163610, 11154372, 'Африка', 'Tuojs'],
             ['Туркмения', 'Ашхабад', 491200, 5439000, 'Азия', 'Turlnfoj6'],
             ['Турция', 'Анкара', 780580, 78741053, 'Азия', 'Turxj6'],
             ['Уганда', 'Кампала', 236040, 36860700, 'Африка', 'Udaoea'],
             ['Узбекистан', 'Ташкент', 447400, 31807000, 'Азия', 'Uibfljstao'],
             ['Украина', 'Киев', 576604, 42650186, 'Европа', 'Ulrajoa'],
             ['Уругвай', 'Монтевидео', 176220, 3480222, 'Южная Америка', 'Urudcak'],
             ['Филиппины', 'Манила', 300000, 102980480, 'Азия', 'Vjmjqqjo2'],
             ['Финляндия', 'Хельсинки', 337030, 5487308, 'Европа', 'Vjom6oej6'],
             ['Франция', 'Париж', 547030, 64513242, 'Европа', 'Vraoxj6'],
             ['Хорватия', 'Загреб', 56542, 4190669, 'Европа', 'Wprcatj6'],
             ['ЦАР', 'Банги', 622984, 5277959, 'Африка', 'XAR'],
             ['Чад', 'Нджамена', 1284000, 14497000, 'Африка', 'Yae'],
             ['Черногория', 'Подгорица', 14026, 622218, 'Европа', 'Yfropdprj6'],
             ['Чехия', 'Прага', 78866, 10553843, 'Европа', 'Yfwj6'],
             ['Чили', 'Сантьяго', 756950, 18006407, 'Южная Америка', 'Yjmj'],
             ['Швейцария', 'Берн', 41290, 8325194, 'Европа', 'Zcfkxarj6'],
             ['Швеция', 'Стокгольм', 449964, 9851017, 'Европа', 'Zcfxj6'],
             ['Эквадор', 'Кито', 283560, 16599593, 'Южная Америка', '_lcaepr'],
             ['Эритрея', 'Асмэра', 121320, 5352000, 'Африка', '_rjtrf6'],
             ['Эстония', 'Таллин', 45226, 1315944, 'Европа', '_stpoj6'],
             ['ЮАР', 'Претория', 1219912, 55908900, 'Африка', '+AR'],
             ['Ямайка', 'Кингстон', 10990, 2723000, 'Северная Америка', '=nakla'],
             ['Япония', 'Токио', 377944, 127103388, 'Азия', '=qpoj6']]

alf1 = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
alf2 = 'abcdefghijklmnopqrstuvwxyz0123456ABCDEFGHIJKLMNOPQRSTUVWXYZ789-_+='



def vibor(spisok, n):
    spisok2 = []
    for i in range(n):
        x = random.randint(0, len(spisok) - 1 - i)
        spisok2.append(spisok[x])
    return spisok2


def continent():
    country = random.choice(countries)
    return [country[0], [['Европа', 'Азия', 'Африка'], ['Северная Америка'], ['Южная Америка'], ['меню']], country[4]]


def capital():
    countries2 = vibor(countries, 4)
    x = random.randint(0, 3)
    return [countries2[x][0], [[countries2[0][1], countries2[1][1]], [countries2[2][1], countries2[3][1]], ['меню']],
            countries2[x][1]]


def flagi():
    countries2 = vibor(countries, 4)
    x = random.randint(0, 3)
    return [countries2[x][5], [[countries2[0][0], countries2[1][0]], [countries2[2][0], countries2[3][0]], ['меню']],
            countries2[x][0]]


def sqare():
    countries2 = vibor(countries, 4)
    x = max(countries2, key=lambda a: a[2])
    return [x[0], [[countries2[0][0], countries2[1][0]], [countries2[2][0], countries2[3][0]], ['меню']]]
